#include <stdio.h>
#include <locale.h>
int V, x;
void main()
{
    V = 4;
    x = 24;
    double run = V*3;
    double time = x/run;
    setlocale(LC_CTYPE, "RUS");
    printf("Расчёт времени затраченного на путь\n");
    printf("=====================================\n\n");
    printf("Условия задачи:\n");
    printf("Скорость ходьбы = %d\n", V);
    printf("Расстояние, которое преодолел мальчик: %d км\n", x);
    printf("Скорость бега мальчика в 3 раза больше скорости ходьбы.\n\n");
    
    printf("Расчёт:\n");
    printf("Скорость бега мальчика: %d * 3 = %2.1f км/ч\n", V, run);
    printf("Время затраченное на преодоление %d км: %d / %2.1f = %2.1f часа\n", x, x, run, time);
    printf("=====================================\n");
    printf("Время, затраченное на путь: %2.1f часа", time);
}